# Используем официальный минималистичный образ Python версии 3.12
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями в рабочую директорию
COPY requirements.txt /app/

# Устанавливаем все зависимости, указанные в requirements.txt
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь проект в рабочую директорию контейнера
COPY . /app/

# Указываем порт, который будет открыт для работы веб-приложения
EXPOSE 8000

# Команду запуска сервера и Celery убрал из Dockerfile.
# Запуск будет перенес в docker-compose.yml для большей гибкости.